# Parameters Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HermiteSpline..::..Parameters Property
HermiteSpline Class See Also
---
Returns the params of the Hermite spline.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DoubleArray Parameters { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Parameters As DoubleArray
	Get
```

Visual C++
---
```text
public:
property DoubleArray^ Parameters {
	DoubleArray^ get ();
}
```

# See Also
HermiteSpline Class
Autodesk.Revit.DB Namespace